import pymongo
categories  = [["Δημητριακά", "Μπάρες δημητριακών","Παιδικά Δημητριακά","Φρυγανίες", "Ζαχαρί", "Ρύζια","Αλευρια & Ειδη Ζαχαροπλαστικής","Ψωμί","Παξιμάδια","Μπαχαρικά", "Ζυμαρικά" ,"Όσπρια", "Παντοπολείο", "Αλλαντικά", "Κρέας κά", "Προιόντα Ζύμης", "Κατεψυγμένα Λαχανικά", "Φρέσκα Φρούτα & Λαχανικά", "Ψάρια & Θαλάσσινά", "Μαρμελάδες, Μέλια & Αλλα αλείμματα"], 
["Γάλα", "Γιαούρτια & Επιδόρπια", "Κρέμες γάλακτος & Βούτυρα", "Παγωτά", "Τυριά", "Αλλα είδη Γάλακτος"], 
["Μπύρες", "Κρασιά","Ποτά" , "Αλλα Σνακς", "Νερά", "Φρεσκοι χυμοί" ,"Χυμοί εκτος ψυγείου & Αναψυκτικά","Μπισκότα", "Ξηροί καρποί","Σοκολάτες", "Αλλα Σνακς", "Καφές & Ροφήματα"],
["Γυναικεία Περιποίηση", "Ανδρική περιποίηση", "Καθαριότητα & Προσωπική Υγειίνή", "Απορρυπαντικά","Περιποίηση Μαλλιών", "Στοματική Υγιεινή", "Ένδυση & Υπόδηση","Προιόντα Περιποιήσης"], 
["Κουζίνα & Μπάνιο","Καθαριστικά Σπιτιού", "Ρούχα", "Εξοπλισμός Σπιτιού", "Χαρτικά"], 
["Βρεφική περιποίηση", "Βρεφικές κρέμες", "Πάνες & Μωρομάντηλα", "Βρεφικά Απορρυπαντικά", "Αξεσουάρ για το μωρό"], 
["Προϊόντα για κατοικίδια", "Βιολογικά Προϊόντα","Άλλα προιόντα"]]

supercategories = ["Τροφιμα", "Γαλακτοκομικά & Τυριά", "Χυμοί, Κάβα & Σνακς","Προσωπική φροντίδα", "Οικιακή φροντίδα", "Βρεφικά Είδη", "Διάφορα"]


correct_list_mymarket = ["Ψωμί","Προιόντα Ζύμης", "Γάλα", "Φρεσκοι χυμοί", "Φρέσκα Φρούτα & Λαχανικά",  "Σοκολάτες", "Μπισκότα", "Ξηροί καρποί", "Βιολογικά Προϊόντα", "Αλευρια & Ειδη Ζαχαροπλαστικής",
   "Αλλα είδη Γάλακτος","Κρέας κά", "Τυριά", "Αλλαντικά", "Γιαούρτια & Επιδόρπια", "Κρέμες γάλακτος & Βούτυρα", "Παιδικά Δημητριακά",  "Φρυγανίες", "Παξιμάδια", "Μπαχαρικά", "Ψάρια & Θαλάσσινά",
 "Κατεψυγμένα Λαχανικά","Παγωτά", "Άλλα προιόντα", "Μαρμελάδες, Μέλια & Αλλα αλείμματα", "Δημητριακά", "Καφές & Ροφήματα", "Ζαχαρί" , "Μπάρες δημητριακών", 
"Παντοπολείο", "Ρύζια", "Όσπρια", "Ζυμαρικά" , "Απορρυπαντικά", "Κουζίνα & Μπάνιο","Καθαριστικά Σπιτιού", "Βρεφικά Απορρυπαντικά", "Εξοπλισμός Σπιτιού", 
"Γυναικεία Περιποίηση", "Ανδρική περιποίηση", "Καθαριότητα & Προσωπική Υγειίνή", "Περιποίηση Μαλλιών", "Στοματική Υγιεινή", "Προιόντα Περιποιήσης", 
"Βρεφική περιποίηση", "Βρεφικές κρέμες", "Πάνες & Μωρομάντηλα", "Αξεσουάρ για το μωρό", "Χαρτικά", "Ρούχα",  "Ένδυση & Υπόδηση", "Χυμοί εκτος ψυγείου & Αναψυκτικά", "Αλλα Σνακς", "Νερά",
"Κρασιά" , "Μπύρες", "Ποτά" , "Προϊόντα για κατοικίδια"]
 
correct_list_ab = ["Ψωμί", "Παξιμάδια","Φρέσκα Φρούτα & Λαχανικά", "Ψάρια & Θαλάσσινά","Παιδικά Δημητριακά", "Δημητριακά", "Μπάρες δημητριακών","Μαρμελάδες, Μέλια & Αλλα αλείμματα","Φρεσκοι χυμοί", "Γάλα", 
"Γιαούρτια & Επιδόρπια", "Κρέμες γάλακτος & Βούτυρα", "Καφές & Ροφήματα", "Μπισκότα", "Σοκολάτες",    
"Ξηροί καρποί", "Κρέας κά", "Τυριά", "Αλλαντικά", "Κρασιά" , "Μπύρες", "Αλλα Σνακς", "Φρυγανίες", "Ζαχαρί" , "Αλλα είδη Γάλακτος", "Αλευρια & Ειδη Ζαχαροπλαστικής",
"Ρύζια", "Όσπρια", "Ζυμαρικά" , "Μπαχαρικά","Παντοπολείο","Ποτά" ,"Νερά", "Χυμοί εκτος ψυγείου & Αναψυκτικά","Προιόντα Ζύμης", "Κατεψυγμένα Λαχανικά","Παγωτά",  
"Κουζίνα & Μπάνιο","Χαρτικά","Καθαριστικά Σπιτιού", "Προϊόντα για κατοικίδια", "Απορρυπαντικά", "Βρεφικά Απορρυπαντικά", "Βιολογικά Προϊόντα", "Ρούχα", "Εξοπλισμός Σπιτιού", 
"Γυναικεία Περιποίηση", "Ανδρική περιποίηση", "Καθαριότητα & Προσωπική Υγειίνή", "Περιποίηση Μαλλιών", "Στοματική Υγιεινή", "Ένδυση & Υπόδηση","Προιόντα Περιποιήσης", 
"Βρεφική περιποίηση", "Βρεφικές κρέμες", "Πάνες & Μωρομάντηλα", "Αξεσουάρ για το μωρό",  "Άλλα προιόντα", ]





input_ab={}
# input_ab["super_market_name"]=""
# input_ab["correct_list"]=correct_list
# input_ab["address"]="Βουλιαγμένης 43-45, 16561 Γλυφάδα"
input_ab["object"]="super_markets"
input_ab["super_market_name"]="ΑΒ Βασιλόπουλος"
input_ab["shorted_items_list"]=correct_list_ab
input_ab["address"]="Βουλιαγμένης 43-45, 16561 Γλυφάδα"

# insert
def get_database():
    CONNECTION_STRING = "mongodb://nikolastas:aQI5IplodxBX3YF3aRAyhEwhjWaOGBaUzjPHnWRf3QjAh1aadTVT1bV0rKiW34Tf98zqBUO6j6D6y6wP2M4Gcw==@nikolastas.mongo.cosmos.azure.com:10255/?ssl=true&replicaSet=globaldb&retrywrites=false&maxIdleTimeMS=120000&appName=@nikolastas@"

    client = pymongo.MongoClient(CONNECTION_STRING)

    return(client)
client = get_database()
db = client.MarketApp
cat = db ["ItemCategories"]
cat.insert_one(input_ab)


input_mymarket={}
input_mymarket["object"]="super_markets"
input_mymarket["super_market_name"]="My Market"
input_mymarket["shorted_items_list"]=correct_list_mymarket
input_mymarket["address"]="Κ. Αθανάτου 5 Σπερχειάδος, Γλυφάδα 16562"
cat.insert_one(input_mymarket)


# super categories --> categories
list_of_cat = []
for ca,sc in zip(categories,supercategories):
    # list_of_supercat.append({"_id":a, "name":sc})
    # a+=1
    for t in ca :
        list_of_cat.append({"name":t, "super_category":sc})
        # b+=1   
# insert list
cat.insert_one({
    "object":"items_list",
    "value":list_of_cat
})

# delete every item
# cat.delete_many({})
